# Pandas Exercise

Importing Pandas and printing version number

In [221]:
import pandas as pd
import numpy as np

In [4]:
print(pd.__version__)

1.4.2

# EXERCISE 1 - List-to-Series Conversion
Given a list, output the corresponding pandas series

In [5]:
lst=['Saurav','Vikcy','Ramesh']

In [6]:
a=pd.Series(lst)

In [7]:
a

0    Saurav
1     Vikcy
2    Ramesh
dtype: object

# EXERCISE 2 - List-to-Series Conversion with Custom Indexing
Given a series, output the corresponding pandas series with odd indexes only

In [8]:
ser1=pd.Series(['Sauarv','Vikcy','Ramesh','Gupta','Amisha'],index=[1,3,5,7,9])

In [10]:
ser1

1    Sauarv
3     Vikcy
5    Ramesh
7     Gupta
9    Amisha
dtype: object

# EXERCISE 3 - Date Series Generation
Generate the series of dates from 1st May, 2021 to 12th May, 2021 (both inclusive)

In [11]:
date=pd.date_range('1st May 2021',periods=12)
date_range=pd.DataFrame(date,columns=['Dates'])

In [12]:
date_range

        Dates
0  2021-05-01
1  2021-05-02
2  2021-05-03
3  2021-05-04
4  2021-05-05
5  2021-05-06
6  2021-05-07
7  2021-05-08
8  2021-05-09
9  2021-05-10
10 2021-05-11
11 2021-05-12

# EXERCISE 4 - Implementing a function on each and every element of a series
Apply the function, f(x) = x/2 on each and every element of a given pandas series

In [13]:
ser = pd.Series([2, 4, 6, 8, 10])

In [15]:
func=ser.apply(lambda x:x/2)

In [16]:
print(func)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

# EXERCISE 5 - Dictionary-to-Dataframe Conversion
Given a dictionary, convert it into corresponding dataframe and display it

In [17]:
frnds={'Names':['Saurav','Rohit','Yashu','Amisha','Sneha'],
      'Age':[24,24,22,20,21],
      'Occupation':['Berojgar','Student','Student','Ladke Ghumna','Student']}

In [18]:
df=pd.DataFrame(frnds)

In [19]:
df

    Names  Age    Occupation
0  Saurav   24      Berojgar
1   Rohit   24       Student
2   Yashu   22       Student
3  Amisha   20  Ladke Ghumna
4   Sneha   21       Student

In [20]:
type(df)

pandas.core.frame.DataFrame

# EXERCISE 6 - 2D List-to-Dataframe Conversion
Given a 2D List, convert it into corresponding dataframe and display it

In [36]:
lst=[['Ravikesh','Yogesh','Sheetal','Rohit'],['Saurav','Yash','Rohit','Ram']]

In [42]:
df=pd.DataFrame(lst,columns=['Name1','Name2','Name3','Name4'],index=['Group1','Group2'])

In [50]:
df.to_csv('Names.csv')

In [46]:
df #LetsFight

           Name1   Name2    Name3  Name4
Group1  Ravikesh  Yogesh  Sheetal  Rohit
Group2    Saurav    Yash    Rohit    Ram

# EXERCISE 7 - Reading CSV to Dataframe
Given a CSV file, read it into a dataframe and display it

In [47]:
titanic_train=pd.read_csv('https://raw.githubusercontent.com/training-ml/Files/main/titanic_train.csv')

In [48]:
titanic_train.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [51]:
name=pd.read_csv('Names.csv')

In [52]:
name

  Unnamed: 0     Name1   Name2    Name3  Name4
0     Group1  Ravikesh  Yogesh  Sheetal  Rohit
1     Group2    Saurav    Yash    Rohit    Ram

# EXERCISE 8 - Setting Custom Index in Dataframe
Given a dataframe, change the index of a dataframe from the default indexes to a particular column

In [102]:
df={'Name':['Saurav','Sheetal','Amisha','Surabhi'],
                'Age':[24,22,20,20],
                'Occupation':['Berojgar','Data Scientist','Student','Student'],
   'Roll Number':[1,2,3,4]}

In [103]:
df

{'Name': ['Saurav', 'Sheetal', 'Amisha', 'Surabhi'],
 'Age': [24, 22, 20, 20],
 'Occupation': ['Berojgar', 'Data Scientist', 'Student', 'Student'],
 'Roll Number': [1, 2, 3, 4]}

In [104]:
df=pd.DataFrame(df,index=[1,2,3,4])

In [150]:
df

      Name  Age      Occupation  Roll Number
0   Saurav   24        Berojgar            4
1  Sheetal   22  Data Scientist            2
2   Amisha   20         Student            3
3  Surabhi   20         Student            1

In [151]:
custom_index=df.set_index('Roll Number')

In [152]:
custom_index

                Name  Age      Occupation
Roll Number
4             Saurav   24        Berojgar
2            Sheetal   22  Data Scientist
3             Amisha   20         Student
1            Surabhi   20         Student

# EXERCISE 9 - Sorting a Dataframe by Index
Given a dataframe (say, with custom indexing), sort it by it's index

In [153]:
df={'Name':['Saurav','Sheetal','Amisha','Surabhi'],
                'Age':[24,22,20,20],
                'Occupation':['Berojgar','Data Scientist','Student','Student'],
   'Roll Number':[4,2,3,1]}

In [154]:
df

{'Name': ['Saurav', 'Sheetal', 'Amisha', 'Surabhi'],
 'Age': [24, 22, 20, 20],
 'Occupation': ['Berojgar', 'Data Scientist', 'Student', 'Student'],
 'Roll Number': [4, 2, 3, 1]}

In [155]:
df=pd.DataFrame(df)

In [156]:
custom_index=df.set_index('Roll Number')

In [157]:
custom_index

                Name  Age      Occupation
Roll Number
4             Saurav   24        Berojgar
2            Sheetal   22  Data Scientist
3             Amisha   20         Student
1            Surabhi   20         Student

In [158]:
custom_index=custom_index.sort_index()

In [159]:
custom_index

                Name  Age      Occupation
Roll Number
1            Surabhi   20         Student
2            Sheetal   22  Data Scientist
3             Amisha   20         Student
4             Saurav   24        Berojgar

# EXERCISE 10 - Sorting a Dataframe by Multiple Columns
Given a dataframe, sort it by multiple columns

In [160]:
df#This is my DataFrame

      Name  Age      Occupation  Roll Number
0   Saurav   24        Berojgar            4
1  Sheetal   22  Data Scientist            2
2   Amisha   20         Student            3
3  Surabhi   20         Student            1

In [167]:
set_index=df.sort_values(by=['Roll Number','Age'])

In [162]:
set_index

      Name  Age      Occupation  Roll Number
3  Surabhi   20         Student            1
1  Sheetal   22  Data Scientist            2
2   Amisha   20         Student            3
0   Saurav   24        Berojgar            4

# EXERCISE 11 - DataFrame with Custom Index to DataFrame with Dataframe with default indexes
Given a dataframe with custom indexing, convert and it to default indexing and display

In [163]:
set_index=set_index.reset_index()

In [164]:
set_index

   index     Name  Age      Occupation  Roll Number
0      3  Surabhi   20         Student            1
1      1  Sheetal   22  Data Scientist            2
2      2   Amisha   20         Student            3
3      0   Saurav   24        Berojgar            4

# EXERCISE 12 - Indexing and Selecting Columns in a DataFrame
Given a dataframe, select a particular column and display it

In [170]:
df

      Name  Age      Occupation  Roll Number
0   Saurav   24        Berojgar            4
1  Sheetal   22  Data Scientist            2
2   Amisha   20         Student            3
3  Surabhi   20         Student            1

In [173]:
o=df['Name']

In [174]:
o

0     Saurav
1    Sheetal
2     Amisha
3    Surabhi
Name: Name, dtype: object

# EXERCISE 13 - Indexing and Selecting Rows in a DataFrame
Given a dataframe, select first 2 rows and output them

In [176]:
df

      Name  Age      Occupation  Roll Number
0   Saurav   24        Berojgar            4
1  Sheetal   22  Data Scientist            2
2   Amisha   20         Student            3
3  Surabhi   20         Student            1

In [177]:
df.loc[0:1,:]

      Name  Age      Occupation  Roll Number
0   Saurav   24        Berojgar            4
1  Sheetal   22  Data Scientist            2

# EXERCISE 14 - Conditional Selection of Rows in a DataFrame
Given a dataframe, select rows based on a condition

In [185]:
df

      Name  Age      Occupation  Roll Number
0   Saurav   24        Berojgar            4
1  Sheetal   22  Data Scientist            2
2   Amisha   20         Student            3
3  Surabhi   20         Student            1

In [186]:
p=df['Age'].loc[df['Age']>=22]

In [182]:
p

0    24
1    22
Name: Age, dtype: int64

# EXERCISE 15 - Applying Aggregate Functions
Given is a dataframe showing name, occupation, salary of people. Find the average salary per occupation

In [214]:
df={'Name':['Saurav','Sheetal','Amisha','Surabhi'],
                'Age':[24,22,20,20],
                'Occupation':['Data Scientist','Data Scientist','Student','Student'],
   'Roll Number':[1,2,3,4],
   'Salary':[2500,6500,3500,5500]}

In [215]:
df=pd.DataFrame(df)

In [216]:
df

      Name  Age      Occupation  Roll Number  Salary
0   Saurav   24  Data Scientist            1    2500
1  Sheetal   22  Data Scientist            2    6500
2   Amisha   20         Student            3    3500
3  Surabhi   20         Student            4    5500

In [218]:
avg=df.groupby('Occupation')['Salary'].mean()

In [219]:
avg

Occupation
Data Scientist    4500.0
Student           4500.0
Name: Salary, dtype: float64

# EXERCISE 16 - Filling NaN Values in a DataFrame
Given a dataframe with NaN Values, fill the NaN values with 0

In [224]:
dic={'Name':['Saurav','Sheetal','Amisha','Sneha'],
    'Age':[24,np.nan,np.nan,20],
    'Email':[np.nan,'xyz','abc',np.nan]}

In [225]:
df=pd.DataFrame(dic)

In [226]:
df

      Name   Age Email
0   Saurav  24.0   NaN
1  Sheetal   NaN   xyz
2   Amisha   NaN   abc
3    Sneha  20.0   NaN

In [232]:
df.fillna(value=0)

      Name   Age Email
0   Saurav  24.0     0
1  Sheetal   0.0   xyz
2   Amisha   0.0   abc
3    Sneha  20.0     0

# EXERCISE 17 - Applying Functions (UDFs) on DataFrame
Given is a dataframe showing Company Names (cname) and corresponding Profits (profit). Convert the values of Profit column such that values in it greater than 0 are set to True and the rest are set to False.

In [234]:
dic={'cname':['Shyam & Co.','Ramlal & Bros.','Sharma Enterprises','Verma Furnitures','Rahul Stores'],
    'profit':[-10000,10000,-5000,15000,20000]}

In [235]:
df=pd.DataFrame(dic)

In [237]:
df

                cname  profit
0         Shyam & Co.  -10000
1      Ramlal & Bros.   10000
2  Sharma Enterprises   -5000
3    Verma Furnitures   15000
4        Rahul Stores   20000

In [239]:
df['profit'].apply(lambda x:x>1)

0    False
1     True
2    False
3     True
4     True
Name: profit, dtype: bool

# EXERCISE 18 - Joining 2 DataFrames by a Common Column (key)
Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID (eid) and designation of the employee (designation). Output the Dataframe containing Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position (position).

In [240]:
left={'eid':[1,2,3,4],
     'ename':['sid','saurav','harry','ron'],
     'stipend':[10000,10000,5000,15000]}

In [241]:
df1=pd.DataFrame(left)

In [242]:
right={'eid':[1,2,3,4],
      'position':['employee','employee','intern','senior_employee']}

In [243]:
df2=pd.DataFrame(right)

In [253]:
join=pd.merge(df1,df2,how='inner',on='eid')

In [254]:
join

   eid   ename  stipend         position
0    1     sid    10000         employee
1    2  saurav    10000         employee
2    3   harry     5000           intern
3    4     ron    15000  senior_employee

# EXERCISE 19 - Getting the Non-Null Count and Data Type for Every Column
Given a dataframe, output the non-null count and data-type for every column

In [255]:
df

                cname  profit
0         Shyam & Co.  -10000
1      Ramlal & Bros.   10000
2  Sharma Enterprises   -5000
3    Verma Furnitures   15000
4        Rahul Stores   20000

In [259]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cname   5 non-null      object
 1   profit  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [260]:
df.notnull()

   cname  profit
0   True    True
1   True    True
2   True    True
3   True    True
4   True    True

# EXERCISE 20 - Getting the Statistical Summary of all the Numerical Features of a DataFrame
Given a dataframe, generate the statistical summary of all the numerical features present in it

In [262]:
df
df.describe()

             profit
count      5.000000
mean    6000.000000
std    12942.179106
min   -10000.000000
25%    -5000.000000
50%    10000.000000
75%    15000.000000
max    20000.000000

In [ ]:
#Student of DataScience
#Student of DataTrained-Saurav
#Date-27-07-2022
#Time-17:27